hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timer2.c
/**
 *******************************************************************************
 * @file  hc32m120_timer2.c
 * @brief This file provides firmware functions to manage the TIMER2
 *        (TIMER2).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2019-06-20       Wuze            First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32m120_timer2.h"
#include "hc32m120_utility.h"

/**
 * @addtogroup HC32M120_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_TIMER2 TIMER2
 * @brief TIMER2 Driver Library
 * @{
 */
#if (DDL_TIMER2_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup TIMER2_Local_Macros TIMER2 Local Macros
 * @{
 */

/**
 * @brief Definitions of TIMER2 trigger event registers.
 */
#define TIMER2_TRIG_EVT_REG                 (M0P_AOS->TMR2_HTSSR)

/**
 * @brief TIMER2 PWM configuration mask.
 */
#define TIMER2_PWM_CFG_MSK                  (TMR2_PCONR_STACA | TMR2_PCONR_STPCA | TMR2_PCONR_CMPCA)

/**
 * @brief TIMER2 PWM comparison match polarity.
 */
#define TIMER2_PWM_CM_TOGGLE                ((uint16_t)TMR2_PCONR_CMPCA)

/**
 * @brief TIMER2 filter sample clock prescaler mask.
 */
#define TIMER2_FILTER_PRESCALER_MSK         (TMR2_PCONR_NOFICKA)

/**
 * @brief TIMER2 hardware controller configuration mask.
 */
#define TIMER2_HW_CFG_MSK                   (TMR2_HCONR_HSTA0 | TMR2_HCONR_HSTA1 | TMR2_HCONR_HSTA2 | \
                                             TMR2_HCONR_HSTP0 | TMR2_HCONR_HSTP1 | TMR2_HCONR_HSTP2 | \
                                             TMR2_HCONR_HCLE0 | TMR2_HCONR_HCLE1 | TMR2_HCONR_HCLE2 | \
                                             TMR2_HCONR_HICP0 | TMR2_HCONR_HICP1 | TMR2_HCONR_HICP2)

/**
 * @brief TRIGA condition.
 */
#define TIMER2_HW_START_TRIGA_MSK           (TMR2_HCONR_HSTA0 | TMR2_HCONR_HSTA1)
#define TIMER2_HW_STOP_TRIGA_MSK            (TMR2_HCONR_HSTP0 | TMR2_HCONR_HSTP1)
#define TIMER2_HW_CLR_TRIGA_MSK             (TMR2_HCONR_HCLE0 | TMR2_HCONR_HCLE1)
#define TIMER2_HW_CAP_TRIGA_MSK             (TMR2_HCONR_HICP0 | TMR2_HCONR_HICP1)

/**
 * @brief TIMER2 basic configuration mask.
 */
#define TIMER2_CLK_CFG_MSK                  (TMR2_BCONR_SYNSA | TMR2_BCONR_CKDIVA | TMR2_BCONR_SYNCLKA | TMR2_BCONR_ASYNCLKA)

/**
 * @defgroup TIMER2_Check_Parameters_Validity TIMER2 check parameters validity
 * @{
 */
#define IS_TIMER2_CLK_SOURCE(x)                                                \
(   ((x) == TIMER2_SYNC_CS_HCLK)            ||                                 \
    ((x) == TIMER2_SYNC_CS_TRIGA_RISE)      ||                                 \
    ((x) == TIMER2_SYNC_CS_TRIGA_FALL)      ||                                 \
    ((x) == TIMER2_SYNC_CS_EVENT)           ||                                 \
    ((x) == TIMER2_ASYNC_CS_LRC)            ||                                 \
    ((x) == TIMER2_ASYNC_CS_CLKA))

#define IS_TIMER2_CLK_PRESCALER(x)                                             \
(   ((x) == TIMER2_CLK_PRESCALER_1)         ||                                 \
    ((x) == TIMER2_CLK_PRESCALER_2)         ||                                 \
    ((x) == TIMER2_CLK_PRESCALER_4)         ||                                 \
    ((x) == TIMER2_CLK_PRESCALER_8)         ||                                 \
    ((x) == TIMER2_CLK_PRESCALER_16)        ||                                 \
    ((x) == TIMER2_CLK_PRESCALER_32)        ||                                 \
    ((x) == TIMER2_CLK_PRESCALER_64)        ||                                 \
    ((x) == TIMER2_CLK_PRESCALER_128)       ||                                 \
    ((x) == TIMER2_CLK_PRESCALER_256)       ||                                 \
    ((x) == TIMER2_CLK_PRESCALER_512)       ||                                 \
    ((x) == TIMER2_CLK_PRESCALER_1024))

#define IS_TIMER2_FILTER_PRESCALER(x)                                          \
(   ((x) == TIMER2_FILTER_PRESCALER_1)      ||                                 \
    ((x) == TIMER2_FILTER_PRESCALER_4)      ||                                 \
    ((x) == TIMER2_FILTER_PRESCALER_16)     ||                                 \
    ((x) == TIMER2_FILTER_PRESCALER_64))

