hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timer2.c
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup TIMER2_Global_Functions TIMER2 Global Functions
 * @{
 */

/**
 * @brief  Set a default value for TIMER2 configuration structure.
 * @param  [in]  pstcCfg            Pointer to a stc_timer2_config_t structure that
 *                                  contains configuration information.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pstcCfg == NULL.
 */
en_result_t TIMER2_StructInit(stc_timer2_config_t *pstcCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcCfg != NULL)
    {
        pstcCfg->u16ClkSource           = TIMER2_SYNC_CS_HCLK;
        pstcCfg->u16ClkPrescaler        = TIMER2_CLK_PRESCALER_1;
        pstcCfg->u16HwStartCondition    = TIMER2_HW_START_INVALID;
        pstcCfg->u16HwStopCondition     = TIMER2_HW_STOP_INVALID;
        pstcCfg->u16HwClearCondition    = TIMER2_HW_CLR_INVALID;
        pstcCfg->u16HwCaptureCondition  = TIMER2_HW_CAP_INVALID;
        pstcCfg->u16PwmStartPolarity    = TIMER2_PWM_START_LOW;
        pstcCfg->u16PwmStopPolarity     = TIMER2_PWM_STOP_LOW;
        pstcCfg->u16FilterPrescaler     = TIMER2_FILTER_PRESCALER_1;
        pstcCfg->enFilterCmd            = Disable;
        pstcCfg->enMatchIntCmd          = Disable;
        pstcCfg->enOvfIntCmd            = Disable;

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-initializes the TIMER2.
 * @param  None
 * @retval None
 */
void TIMER2_DeInit(void)
{
    TIMER2_Stop();

    M0P_TMR2->CNTAR = (uint32_t)0x0;
    M0P_TMR2->CMPAR = (uint32_t)0xFFFF;
    M0P_TMR2->BCONR = (uint32_t)0x0;
    M0P_TMR2->ICONR = (uint32_t)0x0;
    M0P_TMR2->PCONR = (uint32_t)0x0;
    M0P_TMR2->HCONR = (uint32_t)0x0;
    M0P_TMR2->STFLR = (uint32_t)0x0;
}

/**
 * @brief  Configures TIMER2 peripheral as a basic timer according to the specified parameters
 *         in the structure stc_timer2_config_t.
 * @param  [in]  pstcCfg            Pointer to a stc_timer2_config_t structure value that
 *                                  contains the configuration information for TIMER2.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:  -pstcCfg == NULL.
 *                                 -The stop condition is the same as the start condition.
 */
en_result_t TIMER2_TimerConfig(const stc_timer2_config_t *pstcCfg)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint16_t u16Temp;

    if (pstcCfg != NULL)
    {
        DDL_ASSERT(IS_TIMER2_CLK_SOURCE(pstcCfg->u16ClkSource));
        DDL_ASSERT(IS_TIMER2_CLK_PRESCALER(pstcCfg->u16ClkPrescaler));
        DDL_ASSERT(IS_TIMER2_START_CONDITION(pstcCfg->u16HwStartCondition));
        DDL_ASSERT(IS_TIMER2_STOP_CONDITION(pstcCfg->u16HwStopCondition));
        DDL_ASSERT(IS_TIMER2_CLEAR_CONDITION(pstcCfg->u16HwClearCondition));
        DDL_ASSERT(IS_TIMER2_FILTER_PRESCALER(pstcCfg->u16FilterPrescaler));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCfg->enFilterCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCfg->enMatchIntCmd));

        enRet = Ok;
        /* Start condition and stop condition CAN NOT be the same condition. */
        if ((pstcCfg->u16HwStartCondition != TIMER2_HW_START_INVALID) && \
            (pstcCfg->u16HwStopCondition  != TIMER2_HW_STOP_INVALID))
        {
            if ((pstcCfg->u16HwStopCondition >> TMR2_HCONR_HSTP0_POS) == pstcCfg->u16HwStartCondition)
            {
                enRet = ErrorInvalidParameter;
            }
        }

        if (enRet == Ok)
        {
            /* Set comparison value. */
            M0P_TMR2->CMPAR = (uint32_t)pstcCfg->u16CompareVal;

            /* Set start condition and stop condition. */
            u16Temp = (pstcCfg->u16HwStartCondition | \
                       pstcCfg->u16HwStopCondition  | \
                       pstcCfg->u16HwClearCondition);
            M0P_TMR2->HCONR = (uint32_t)u16Temp;

            /* Set the prescaler of TRIGA filter. */
            M0P_TMR2->PCONR = (uint32_t)pstcCfg->u16FilterPrescaler;

            /* Enable or Disable the TRIGA filter. */
            bM0P_TMR2->PCONR_b.NOFIENA = (uint32_t)pstcCfg->enFilterCmd;

            /* Enable or Disable the counter match interrupt. */
            bM0P_TMR2->ICONR_b.CMENA   = (uint32_t)pstcCfg->enMatchIntCmd;

            /* Enable or Disable the counter match interrupt. */
            bM0P_TMR2->ICONR_b.OVENA   = (uint32_t)pstcCfg->enOvfIntCmd;

            /* Set the clock source and clock prescaler. */
            u16Temp = pstcCfg->u16ClkSource | pstcCfg->u16ClkPrescaler;
            M0P_TMR2->BCONR = (uint32_t)u16Temp;
        }
    }

    return enRet;
}

/**
 * @brief  Configures TIMER2 peripheral as a PWM function according to the specified parameters
 *         in the structure stc_timer2_config_t.
 * @param  [in]  pstcCfg            Pointer to a stc_timer2_config_t structure value that
 *                                  contains the configuration information for TIMER2.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:  -pstcCfg == NULL.
 *                                 -The stop condition is the same as the start condition.
 *                                 -The start condition is the edge of TRIGA or the stop condition is the edge of TRIGA.
 */
en_result_t TIMER2_PwmConfig(const stc_timer2_config_t *pstcCfg)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint16_t u16StopCondition;
    uint16_t u16Temp;

    if (pstcCfg != NULL)
    {
        DDL_ASSERT(IS_TIMER2_CLK_SOURCE(pstcCfg->u16ClkSource));
        DDL_ASSERT(IS_TIMER2_CLK_PRESCALER(pstcCfg->u16ClkPrescaler));
        DDL_ASSERT(IS_TIMER2_START_CONDITION(pstcCfg->u16HwStartCondition));
        DDL_ASSERT(IS_TIMER2_STOP_CONDITION(pstcCfg->u16HwStopCondition));
        DDL_ASSERT(IS_TIMER2_PWM_START_POLARITY(pstcCfg->u16PwmStartPolarity));
        DDL_ASSERT(IS_TIMER2_PWM_STOP_POLARITY(pstcCfg->u16PwmStopPolarity));

